app/controllers/weathers_controller.rb

SELECT "weathers".* FROM "weathers"
---
  def index
    @weathers = Weather.all

SELECT "weathers".* FROM "weathers" WHERE "weathers"."id" = ? LIMIT 1  [["id", "4"]]
---
  def show
    @weather = Weather.find(params[:id])